<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"4b6aa7c2e724868a152c668c4c734e6d05ddcd0db2941b528b783ebb22be4979","plan_job_ref":"Job Staging Environment #78 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9135611200","plan_out_hash":"34e3e66543c5dca2b5b697e7f17c93f7edb7f4da381d2ad177e4f663df375703","plan_hash":"dd69a067a3adab7e21f9d57633cbae035da6e2c023cf38a2b4856d0f7b94a485","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 10 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.breakpoints-min-js will be created
+   resource "aws_s3_object" "breakpoints-min-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "d2a44a985b34927fd6eaa6d2646bd0fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "breakpoints.min.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/breakpoints.min.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.browser-min-js will be created
+   resource "aws_s3_object" "browser-min-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "a868efbf2f2c23c8c9173096bd3f2dee"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "browser.min.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/browser.min.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.jquery-min-js will be created
+   resource "aws_s3_object" "jquery-min-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "8fb8fee4fcc3cc86ff6c724154c49c42"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "jquery.min.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/jquery.min.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.jquery-scrollex-min-js will be created
+   resource "aws_s3_object" "jquery-scrollex-min-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "830ab00c7d7a5be0c57f91e35bd32376"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "jquery.scrollex.min.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/jquery.scrollex.min.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.jquery-scrolly-min-js will be created
+   resource "aws_s3_object" "jquery-scrolly-min-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "cdaa947ce14cf917fd3fbb34bbf69292"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "jquery.scrolly.min.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/jquery.scrolly.min.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.main-css will be created
+   resource "aws_s3_object" "main-css" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "5a6c4e6bd19b069f60bff00677188112"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "main.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/main.css"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.main-js will be created
+   resource "aws_s3_object" "main-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "840a9a42fcd550d12c040c3ae8620283"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "main.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/main.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.noscript-css will be created
+   resource "aws_s3_object" "noscript-css" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "7f0a5a22e5d110bb7c52fd7fa2c9424f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "noscript.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/noscript.css"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                          = "6175c0c81dd1d9ae6e57660f781f3203" -> "06614d344859b420e06bcfc13732539d"
        id                            = "index.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (24 unchanged attributes hidden)
    }

  # aws_s3_object.photo will be created
+   resource "aws_s3_object" "photo" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "ed16dc4068569b9c693d558100f82945"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "pic01-vintage2.jpg"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/pic01-vintage2.jpg"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.util-js will be created
+   resource "aws_s3_object" "util-js" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "31f3e8b0cbedca627878a2b6d868bc14"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "util.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/util.js"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

Plan: 10 to add, 3 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Staging Environment #78](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9135611200)